# Working with JSON

In [3]:
import pandas as pd

## 1. Reading local file

In [3]:
pd.read_json('train.json')

          id      cuisine                                        ingredients
0      10259        greek  [romaine lettuce, black olives, grape tomatoes...
1      25693  southern_us  [plain flour, ground pepper, salt, tomatoes, g...
2      20130     filipino  [eggs, pepper, salt, mayonaise, cooking oil, g...
3      22213       indian                [water, vegetable oil, wheat, salt]
4      13162       indian  [black pepper, shallots, cornflour, cayenne pe...
...      ...          ...                                                ...
39769  29109        irish  [light brown sugar, granulated sugar, butter, ...
39770  11462      italian  [KRAFT Zesty Italian Dressing, purple onion, b...
39771   2238        irish  [eggs, citrus fruit, raisins, sourdough starte...
39772  41882      chinese  [boneless chicken skinless thigh, minced garli...
39773   2362      mexican  [green chile, jalapeno chilies, onions, ground...

[39774 rows x 3 columns]

## 2. Reading from api

In [5]:
pd.read_json('https://openlibrary.org/search.json?q=harry+potter')

,numFound,start,numFoundExact,num_found,documentation_url,q,offset,docs
0,3758,0,True,3758,https://openlibrary.org/dev/docs/api/search,harry potter,NaN,"{'author_key': ['OL23919A'], 'author_name': ['..."
1,3758,0,True,3758,https://openlibrary.org/dev/docs/api/search,harry potter,NaN,"{'author_key': ['OL23919A'], 'author_name': ['..."
2,3758,0,True,3758,https://openlibrary.org/dev/docs/api/search,harry potter,NaN,"{'author_key': ['OL23919A'], 'author_name': ['..."
3,3758,0,True,3758,https://openlibrary.org/dev/docs/api/search,harry potter,NaN,"{'author_key': ['OL23919A'], 'author_name': ['..."
4,3758,0,True,3758,https://openlibrary.org/dev/docs/api/search,harry potter,NaN,"{'author_key': ['OL23919A'], 'author_name': ['..."
...,...,...,...,...,...,...,...,...
95,3758,0,True,3758,https://openlibrary.org/dev/docs/api/search,harry potter,NaN,"{'author_key': ['OL7685480A'], 'author_name': ..."
96,3758,0,True,3758,https://openlibrary.org/dev/docs/api/search,harry potter,NaN,"{'author_key': ['OL7685480A'], 'author_name': ..."
97,3758,0,True,3758,https://openlibrary.org/dev/docs/api/search,harry potter,NaN,"{'author_key': ['OL8167783A'], 'author_name': ..."
98,3758,0,True,3758,https://openlibrary.org/dev/docs/api/search,harry potter,NaN,"{'author_key': ['OL7685480A'], 'author_name': ..."
99,3758,0,True,3758,https://openlibrary.org/dev/docs/api/search,harry potter,NaN,"{'author_key': ['OL7685480A'], 'author_name': ..."

# Working with SQL

In [5]:
import pandas as pd
import mysql.connector

In [10]:
conn = mysql.connector.connect(host='localhost', user='', password='', database='ml_project') # put your use and password

In [13]:
df = pd.read_sql_query("SELECT * FROM house_prices", conn)

C:\Users\sumit\AppData\Local\Temp\ipykernel_8832\4198952520.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql_query("SELECT * FROM house_prices", conn)

In [14]:
df.head()

   id  area_sqft  bedrooms  bathrooms  floors  age  location_score   price
0   1       1200         2          1       1   10               7  120000
1   2       1500         3          2       1    5               8  180000
2   3       1800         3          2       2    3               9  250000
3   4       2200         4          3       2    2               9  320000
4   5        900         2          1       1   15               6   90000